Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་བརྩམས་ཤིང་སྤོབས།
en: He speaks inspirationally about the perfection of generosity.

source: ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་བརྩམས་ཤིང་སྤོབས་པ་དང་།
en: He speaks inspirationally about the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom.

source: ནང་སྟོང་པ་ཉིད་དང་། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་དུ་བརྩམས་ཤིང་སྤོབས་པ་དང་། དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་བརྩམས་ཤིང་སྤོབས་པ་དང་། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: He speaks inspirationally about the emptiness of internal phenomena, and [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་བརྩམས་ཤིང་སྤོབས་པ་དང་།
en: He speaks inspirationally about the applications of mindfulness, and he speaks inspirationally about the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path.

source: འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་བརྩམས་ཤིང་སྤོབས་པ་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་།
en: He speaks inspirationally about the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions.

source: མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་བརྩམས་ཤིང་སྤོབས་པ་དང་།
en: He speaks inspirationally about the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་བརྩམས་ཤིང་སྤོབས་པ་དང་།
en: He speaks inspirationally about the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, and the distinct qualities of the buddhas.

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་དུ་བརྩམས་ཤིང་སྤོབས་པ་ནི་ངོ་མཚར་ཆེའོ།
en: He speaks inspirationally about [the goals], up to and including all-aspect omniscience.” “

source: །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། ཀཽ་ཤི་ཀ་གནས་བརྟན་རབ་འབྱོར་སྟོང་པ་ཉིད་ལ་རྣམ་པར་སྤྱོད་པས། སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཉིད་ཀྱང་མི་དམིགས་ན། གང་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལྟ་ཅི་སྨོས། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དང་།
en: Kauśika,” replied the Blessed One, “since the elder Subhūti does not apprehend even the perfection of generosity because he dwells in emptiness, how could he possibly [apprehend] anyone practicing the perfection of generosity?

source: བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཉིད་ཀྱང་མི་དམིགས་ན། གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative concentration, and the perfection of wisdom, how could he possibly [apprehend] anyone practicing the perfection of wisdom [and so forth]?

source: ནང་སྟོང་པ་ཉིད་ཀྱང་མི་དམིགས་ན། གང་ནང་སྟོང་པ་ཉིད་ལ་བསྒོམ་པ་ལྟ་ཅི་སྨོས། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ཡང་མི་དམིགས་ན།
en: Since he does not apprehend even the emptiness of internal phenomena, how could he possibly [apprehend] anyone cultivating the emptiness of internal phenomena?

source: གང་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ལ་བསྒོམ་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even [all the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentities, how could he possibly [apprehend] anyone cultivating the emptiness of the essential nature of nonentities [and so forth]?

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ཀྱང་མི་དམིགས་ན། གང་དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་བསྒོམ་པ་ལྟ་ཅི་སྨོས། ཡང་དག་པར་སྤོང་བ་རྣམས་དང་།
en: Since he does not apprehend even the applications of mindfulness, how could he possibly [apprehend] anyone cultivating the applications of mindfulness?

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་རྣམས་དང་། དབང་པོ་རྣམས་དང་། སྟོབས་རྣམས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ཡང་མི་དམིགས་ན། གང་འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་སྤྱོད་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the correct exertions, the supports for miraculous ability, the faculties, the powers, the branches of enlightenment, and the noble eightfold path, how could he possibly [apprehend] anyone cultivating the noble eightfold path [and so forth]?

source: འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ཀྱང་མི་དམིགས་ན། གང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་ལ་བསྒོམ་པ་ལྟ་ཅི་སྨོས། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: Since he does not apprehend even the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, and the formless absorptions, how could he possibly [apprehend] anyone cultivating the formless absorptions [and so forth]?

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱང་མི་དམིགས་ན། གང་གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་བསྒོམ་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways, how could he possibly [apprehend] anyone cultivating the dhāraṇī gateways [and so forth]?

source: དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་ཀྱང་མི་དམིགས་ན། གང་དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་མངོན་པར་བསྒྲུབ་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the powers of the tathāgatas, how could he possibly [apprehend] anyone actualizing the powers of the tathāgatas?

source: མི་འཇིགས་པ་རྣམས་ཀྱང་མི་དམིགས་ན། གང་མི་འཇིགས་པ་རྣམས་མངོན་པར་བསྒྲུབ་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the fearlessnesses, how could he possibly [apprehend] anyone actualizing the fearlessnesses?

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་ཀྱང་མི་དམིགས་ན། གང་སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་མངོན་པར་བསྒྲུབ་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the kinds of exact knowledge, how could he possibly [apprehend] anyone actualizing the kinds of exact knowledge?

source: སྙིང་རྗེ་ཆེན་པོ་ཉིད་ཀྱང་མི་དམིགས་ན། གང་སྙིང་རྗེ་ཆེན་པོ་ལ་རྣམ་པར་སྤྱོད་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even great compassion, how could he possibly [apprehend] anyone practicing great compassion?

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་མི་དམིགས་ན། གང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་མངོན་པར་བསྒྲུབ་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the distinct qualities of the buddhas, how could he possibly [apprehend] anyone actualizing the distinct qualities of the buddhas?

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྣམས་ཀྱང་མི་དམིགས་ན། གང་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the branches of enlightenment, how could he possibly [apprehend] anyone attaining consummate buddhahood, enlightenment?

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་མི་དམིགས་ན། གང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་རྗེས་སུ་འཐོབ་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even all-aspect omniscience, how could he possibly [apprehend] anyone attaining all-aspect omniscience?

source: དེ་བཞིན་གཤེགས་པ་ཉིད་ཀྱང་མི་དམིགས་ན། གང་དེ་བཞིན་གཤེགས་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the Tathāgata, how could he possibly [apprehend] anyone becoming a tathāgata?

source: མ་སྐྱེས་པ་ཉིད་ཀྱང་མི་དམིགས་ན། གང་མ་སྐྱེས་པ་མངོན་པར་འདུ་བྱེད་པ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the nature of nonarising, how could he possibly [apprehend] anyone realizing the nature of nonarising?

source: མཚན་རྣམས་ཀྱང་མི་དམིགས་ན། གང་གི་ལུས་ལ་མཚན་ཡོད་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས།
en: Since he does not apprehend even the major marks, how could he possibly [apprehend] anyone’s body having the major marks!

source: དཔེ་བྱད་རྣམས་ཀྱང་མི་དམིགས་ན། གང་གི་ལུས་ལ་དཔེ་བྱད་ཡོད་པར་འགྱུར་བ་ལྟ་ཅི་སྨོས། དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Since he does not apprehend even the minor marks, how could he possibly [apprehend] anyone’s body having the minor marks? “

source: ཀཽ་ཤི་ཀ་གནས་བརྟན་རབ་འབྱོར་ནི་ཆོས་ཐམས་ཅད་དབེན་པ་ལ་རྣམ་པར་སྤྱོད་པ་སྟེ།
en: If you ask why, Kauśika, the elder Subhūti dwells in the voidness of all phenomena.

source: དམིགས་སུ་མེད་པ་ལ་རྣམ་པར་སྤྱོད་པ། སྟོང་པ་ཉིད་ལ་རྣམ་པར་སྤྱོད་པ། མཚན་མ་མེད་པ་ལ་རྣམ་པར་སྤྱོད་པ། སྨོན་པ་མེད་པ་ལ་རྣམ་པར་སྤྱོད་པ་སྟེ།
en: He dwells in nonapprehension, he dwells in emptiness, he dwells in signlessness, and he dwells in wishlessness.

source: ཀཽ་ཤི་ཀ་གནས་བརྟན་རབ་འབྱོར་གྱི་རྣམ་པར་སྤྱོད་པ་གང་ཡིན་པ་དེས་ནི། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་རྣམ་པར་སྤྱོད་པའི་རྣམ་པར་སྤྱོད་པ་ལ་བརྒྱའི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ །
en: However, Kauśika, this abiding of the elder Subhūti comes nowhere near even a hundredth part of the abiding of bodhisattva great beings who dwell in the perfection of wisdom.

source: སྟོང་གི་ཆ་དང་། བརྒྱ་ཕྲག་སྟོང་གི་ཆ་དང་། བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་ཕྲག་སྟོང་གི་བར་གྱི་ཆར་ཡང་ཉེ་བར་མི་འགྲོ །
en: It comes nowhere near even a thousandth part, a hundred thousandth part, or a one hundred billion trillionth part of it.

source: གྲངས་དང་ཆ་དང་། བགྲང་བ་དང་། དཔེ་དང་རྒྱུར་ཡང་མི་བཟོད་དོ། །དེ་ཅིའི་ཕྱིར་ཞེ་ན།
en: Nor can it stand up to any number, fraction, categorization, comparison, or quality.

source: དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་སྤྱོད་པའི་རྣམ་པར་སྤྱོད་པ་མ་གཏོགས་པར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་རྣམ་པར་སྤྱོད་པ་གང་ཡིན་པ་དང་། ཉན་ཐོས་རྣམས་ཀྱི་རྣམ་པར་སྤྱོད་པ་གང་ཡིན་པ་དང་། རང་སངས་རྒྱས་རྣམས་ཀྱི་རྣམ་པར་སྤྱོད་པ་གང་ཡིན་པའི་རྣམ་པར་སྤྱོད་པ་དེ་དག་ལས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་རྣམ་པར་སྤྱོད་པ་འདི་ཉིད་མཆོག་ཅེས་བྱའོ། །རབ་ཅེས་བྱའོ། །ཕུལ་ཞེས་བྱའོ།
en: If you ask why, except for the abiding of the tathāgatas, among the [other sorts of abiding], namely the abiding of bodhisattva great beings, the abiding of the śrāvakas, and the abiding of the pratyekabuddhas, it is the abiding of bodhisattva great beings who practice the perfection of wisdom that is said to be supreme.

source: །དམ་པ་ཞེས་བྱའོ། །གྱ་ནོམ་པ་ཞེས་བྱའོ། །བླ་ན་མེད་པ། གོང་ན་མེད་པ། མཉམ་པ་མེད་པ།
en: It is said to be best, it is said to be foremost, it is said to be sacred, it is said to be perfect, it is said to be supreme, it is said to be sublime, it is said to be unsurpassed, it is said to be highest, it is said to be unequaled, and it is said to be equal to the unequaled.

source: མི་མཉམ་པ་དང་མཉམ་པ་ཞེས་བྱའོ། །ཀཽ་ཤི་ཀ་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མཆོག་ཏུ་འགྱུར་བར་འདོད་པས། འདི་ལྟ་སྟེ། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྤྱོད་པ་འདི་ཉིད་ཀྱིས་རྣམ་པར་སྤྱད་པར་བྱའོ།
en: Therefore, Kauśika, bodhisattva great beings who wish to become supreme among all beings should dwell in accordance with this abiding of the perfection of wisdom.

source: །དེ་ཅིའི་ཕྱིར་ཞེ་ན། ཀཽ་ཤི་ཀ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ནི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལས་འདས་ཏེ།
en: If you ask why, Kauśika, bodhisattva great beings who practice this perfection of wisdom pass beyond the levels of the śrāvakas and pratyekabuddhas.

source: བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་འཇུག་གོ །བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མེད་པར་ཞུགས་ནས། སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱེད་པར་འགྱུར་རོ།
en: They enter a bodhisattva’s full maturity, and, having entered into the maturity of the bodhisattvas, they perfect the attributes of the buddhas.

source: །སངས་རྒྱས་ཀྱི་ཆོས་རྣམས་ཡོངས་སུ་རྫོགས་པར་བྱས་ནས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་རྗེས་སུ་འཐོབ་པར་འགྱུར་རོ།
en: Having perfected the attributes of the buddhas, they attain the wisdom of all-aspect omniscience.

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཡེ་ཤེས་རྗེས་སུ་ཐོབ་ནས། བག་ཆགས་ཀྱི་མཚམས་སྦྱོར་བའི་ཉོན་མོངས་པ་ཐམས་ཅད་སྤངས་པའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སུ་འགྱུར་རོ།
en: Having attained the wisdom of all-aspect omniscience, they become tathāgatas, arhats, completely awakened buddhas in whom all afflicted mental states associated with reincarnation through the continuity of propensities are abandoned.”

source: །དེ་ནས་འཁོར་དེའི་ནང་ནས་སུམ་ཅུ་རྩ་གསུམ་གྱི་ལྷ་རྣམས་མེ་ཏོག་མན་དཱ་ར་བ་མང་པོ་ཐོགས་ཏེ། བཅོམ་ལྡན་འདས་ལ་གཏོར་ཏོ། །མངོན་པར་གཏོར་ཏོ། །རབ་ཏུ་གཏོར་ཏོ།
en: Then, within that assembly, the gods of the Trayastriṃśa realm took many coral flowers, and sprinkled them, scattered them, and showered them toward the Blessed One.

source: །དགེ་སློང་བརྒྱ་དྲུག་ཅུ་ཙམ་ཡང་སྟན་ལས་ལོངས་ནས། ཆོས་གོས་ཕྲག་པ་གཅིག་ལ་གཟར་ཏེ། བུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས། བཅོམ་ལྡན་འདས་གང་ན་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བ་བཏུད་ནས། བཅོམ་ལྡན་འདས་ལ་མིག་མི་འཛུམ་པར་ལྟ་ཞིང་ཕྱག་འཚལ་ལོ།
en: Some six thousand monks also rose from their seats, and, with their upper robe over one shoulder, resting their right knee on the ground, and placing their hands together in the gesture of homage alongside the Blessed One, they bowed toward the Blessed One, paying homage with their eyes wide open.

source: །དགེ་སློང་དེ་དག་གིས་ཐལ་མོ་སྦྱར་ཏེ་བཏུད་པའི་ཚེ། སངས་རྒྱས་ཀྱི་མཐུས་སྙིམ་པ་མེ་ཏོག་མན་དཱ་ར་བས་གང་བར་གྱུར་ནས། མེ་ཏོག་མན་དཱ་ར་བ་དེ་དག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་གཏོར་ཏོ། །མངོན་པར་གཏོར་ཏོ། །རབ་ཏུ་གཏོར་ཏོ།
en: When these monks bowed with their hands together in the gesture of homage, by the power of the buddhas their cupped hands were filled with coral flowers, and they then sprinkled these coral flowers, scattered them, and showered them toward the tathāgata, arhat, completely awakened Buddha. {

source: །དེ་ལྟར་འཐོར་ཞིང་མངོན་པར་འཐོར་བ་དང་།
en: Ki.

source: རབ་ཏུ་འཐོར་བ་དེའི་ཚེ་ཚིག་འདི་སྐད་ཅེས་བརྗོད་དེ། བཅོམ་ལྡན་འདས་དགེ་བའི་རྩ་བ་འདིས་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱི་སྤྱོད་ཡུལ་མ་ལགས་པའི་རྣམ་པར་སྤྱོད་པ་དམ་པས། བདག་ཅག་རྣམ་པར་སྤྱོད་པར་གྱུར་ཅིག་ཅེས་སྨྲས་པ་དང་།
en: V: 69} At that time, they said, “Blessed Lord, through this root of virtue may we dwell in accordance with the highest abiding, which is not within the perceptual range of any of the śrāvakas or pratyekabuddhas!”

source: དེ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་དགེ་སློང་དེ་དག་གི་བསམ་པ་ཐུགས་སུ་ཆུད་དེ། དེའི་ཚེ་འཛུམ་པ་མཛད་དོ། །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཉིད་ཀྱིས་ཀྱང་དེ་སྟེ། དེ་ལྟར་འཛུམ་པ་མཛད་པའི་ཚེ།
en: It was at that moment that the Blessed One, understanding the aspiration of these monks, smiled.

source: བཅོམ་ལྡན་འདས་ཀྱི་ཞལ་གྱི་སྒོ་ནས། འདི་ལྟ་སྟེ། འོད་ཟེར་སྔོན་པོ་དང་། སེར་པོ་དང་། དམར་པོ་དང་།
en: The true nature of the lord buddhas is indeed such that when the Blessed One smiled diverse rays of light were diffused from his mouth in the colors blue, yellow, red, white, scarlet, crystal, and silver.

source: དཀར་པོ་དང་། ལེབ་རྒན་དང་། ཤེལ་དང་དངུལ་གྱི་ཁ་དོག་ལྟ་བུ་རྣམ་པ་སྣ་ཚོགས་བྱུང་སྟེ། དེ་དག་གིས་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་སྣང་བས་རྒྱས་པར་བཀང་ནས་ཕྱིར་འདུས་ཏེ། བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་དུ་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: These rays extensively filled the world system of the great trichiliocosm with light, and then were reabsorbed, circling the Blessed One three times before vanishing into the crown of the Blessed One’s head.

source: བཅོམ་ལྡན་འདས་ཀྱི་དབུའི་གཙུག་ཏུ་ནུབ་བོ། དེ་ནས་ཚེ་དང་ལྡན་པ་དགའ་བོ་སྟན་ལས་ལངས་ནས། བླ་གོས་ཕྲག་པ་གཅིག་ཏུ་བྱས་ཏེ། པུས་མོ་གཡས་པའི་ལྷ་ང་ས་ལ་བཙུགས་ནས།
en: Then the venerable Ānanda arose from his seat, and with his upper robe over one shoulder, he rested his right knee on the ground.

source: བཅོམ་ལྡན་འདས་ག་ལ་བ་དེ་ལོགས་སུ་ཐལ་མོ་སྦྱར་བས་བཏུད་དེ། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ནི་རྒྱུ་དང་རྐྱེན་མ་མཆིས་པར་འཛུམ་པ་མི་མཛད་ན། ཅིའི་རྒྱུ་ཅིའི་རྐྱེན་གྱིས་འཛུམ་པ་མཛད། དེ་སྐད་ཅེས་གསོལ་པ་དང་།
en: Placing his hands together in the gesture of homage, he bowed toward the Blessed One, saying, “Blessed Lord, since the tathāgatas, arhats, completely awakened buddhas do not smile without a reason or circumstances, what is the reason and what are the circumstances for your smile?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་ཚེ་དང་ལྡན་པ་དགའ་བོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །དགའ་བོ་དགེ་སློང་བརྒྱ་དྲུག་ཅུ་བོ་འདི་དག་བསྐལ་པ་དཔེ་སྐར་མ་ལྟ་བུ་ལ། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་སྟེ། མེ་ཏོག་སིལ་མ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ཤ་སྟག་འཇིག་རྟེན་དུ་འབྱུང་བར་འགྱུར་རོ།
en: The Blessed One replied to the venerable Ānanda as follows: “Ānanda, these six thousand monks, during the eon of Tārakopama, will attain consummate buddhahood in unsurpassed, complete enlightenment, and they will all appear in the world as tathāgatas, arhats, completely awakened buddhas named Avakīrṇakusuma.

source: །དགའ་བོ་མེ་ཏོག་སིལ་མ་ཞེས་བྱ་བའི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་གི་དགེ་སློང་གི་དགེ་འདུན་མཚུངས་པར་འགྱུར།
en: Ānanda, the monastic communities of those tathāgatas, arhats, completely awakened buddhas named Avakīrṇakusuma will be similar.

source: སངས་རྒྱས་ཀྱི་ཞིང་མཚུངས་པར་འགྱུར། ཚེའི་ཚད་ཀྱང་འདི་ལྟ་སྟེ། ལོ་སྟོང་དུ་མཚུངས་པར་འགྱུར་ཏེ།
en: Their buddhafields will be similar and their lifespans of a thousand years will also be similar.

source: དེ་དག་གང་དང་གང་ནས་མངོན་པར་འབྱུང་བར་འགྱུར་བ་དང་། མངོན་པར་བྱུང་ནས་རབ་ཏུ་འབྱུང་བ་དང་། རབ་ཏུ་བྱུང་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་དེ་དང་དེ་དག་ཏུ་མེ་ཏོག་ཁ་དོག་རྣམ་པ་ལྔ་དང་ལྡན་པའི་མེ་ཏོག་གི་ཆར་མངོན་པར་འབབ་པར་འགྱུར་རོ།
en: Wherever they are emancipated [from the household life]; wherever, after being emancipated, they are ordained as mendicants; and wherever, having been ordained as mendicants, they attain consummate buddhahood in unsurpassed, complete enlightenment, showers of five-colored flowers will rain down on them all.

source: །དགའ་བོ་དེ་བས་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམ་པར་སྤྱོད་པའི་དམ་པས་རྣམ་པར་སྤྱོད་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་འདི་ལ་སྤྱད་པར་བྱའོ།
en: Therefore, Ānanda, bodhisattva great beings who wish to dwell in accordance with the highest abiding should practice this perfection of wisdom.

source: །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་རྣམ་པར་སྤྱོད་པས་རྣམ་པར་སྤྱོད་པར་འདོད་པས། ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ལ་སྤྱད་པར་བྱའོ།
en: Bodhisattva great beings who wish to dwell in accordance with the abiding of the tathāgatas should practice this perfection of wisdom. “

source: །དགའ་བོ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤྱོད་པའི་རིགས་ཀྱི་བུ་དང་། རིགས་ཀྱི་བུ་མོ་དེས་འདི་ལྟར་བདག་ནི་མིའི་ནང་ནས་ཤི་འཕོས་ནས་འདིར་སྐྱེས་པ་འམ། དགའ་ལྡན་གྱི་ལྷའི་རིས་ནས་ཤི་འཕོས་ནས་འདིར་སྐྱེས་པ་སྟེ།
en: Ānanda, any noble son or noble daughter who practices this profound perfection of wisdom should certainly know that when they themselves have died among human beings and transmigrated, they will be reborn here, or else when they have died among the gods of the Tuṣita realm, they will be reborn here.

source: མིའི་ནང་དུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་རྒྱ་ཆེར་ཐོས་པ་འམ།
en: For it is among human beings that this profound perfection of wisdom is extensively heard, {Ki.

source: དགའ་ལྡན་གྱི་ལྷའི་རིས་སུ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་རྒྱ་ཆེར་ཐོས་པའོ་ཞེས་བྱ་བར་རྟོགས་པར་རིག་པར་བྱའོ།
en: V: 70} or among the gods of the Tuṣita realm that this profound perfection of wisdom is extensively heard. “

source: །དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གང་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ལ་སྤྱོད་པ་དེ་དག་དེ་བཞིན་གཤེགས་པས་རྣམ་པར་གཟིགས་པར་བལྟ་སྟེ། དགའ་བོ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་ལ་ལ་ཞིག་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཉན་པ་དང་། ཐོས་ནས་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་།
en: Ānanda, those bodhisattva great beings who practice this profound perfection of wisdom will be observed by the tathāgatas.

source: ཀུན་ཆུབ་པར་བྱེད་པ་དང་། ཚུལ་བཞིན་དུ་ཡིད་ལ་བྱེད་པ་དང་། གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་བ་རྣམས་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་ཟབ་མོ་འདི་སྟོན་ཅིང་རྗེས་སུ་འདོམས་པའི་གང་ཟག་བྱང་ཆུབ་སེམས་དཔའི་ཐེག་པ་པ་དེས། བདག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལས། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་པར་གྱུར།
en: Ānanda, when any noble sons or noble daughters who hear this profound perfection of wisdom, and, having listened to it, then take up, uphold, recite, master, and focus their attention correctly on it, and then reveal and teach this profound perfection of wisdom to individuals who follow the vehicle of the bodhisattvas, those individuals who follow the vehicle of the bodhisattvas should certainly know that they themselves will have heard this profound perfection of wisdom from the tathāgatas, arhats, completely awakened buddhas, and will have taken up, upheld, recited, and mastered it.

source: བཟུང་བ་དང་། བཅངས་པ་དང་། བླགས་པ་དང་། ཀུན་ཆུབ་པར་བྱས་པར་གྱུར་ཏེ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་དག་ལ་ཡང་དགེ་བའི་རྩ་བ་མང་པོ་བསྐྱེད་པར་གྱུར་ཏོ་ཞེས་བྱ་བར་རྟོགས་པར་རིག་པར་བྱ་སྟེ།
en: They will have cultivated many roots of virtuous action in the presence of those tathāgatas, arhats, completely awakened buddhas. “

source: དགའ་བོ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེས་བདག་གིས་ནི་ཉན་ཐོས་རྣམས་ལ་དགེ་བའི་རྩ་བ་མ་བསྐྱེད། ཉན་ཐོས་རྣམས་ལས་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་ཐོས་པ་མ་ཡིན་ནོ་ཞེས་བྱ་བར་རིག་པར་བྱའོ། །དགའ་བོ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་འཛིན་པ་དང་། འཆང་བ་དང་། ཀློག་པ་དང་།
en: Ānanda, these noble sons or noble daughters should know that they will not cultivate the roots of virtuous action in the presence of śrāvakas, and they will not hear this profound perfection of wisdom from śrāvakas. “

source: ཀུན་ཆུབ་པར་བྱེད་པ་དང་། དོན་དང་ཆོས་དང་། ཡི་གེ་དང་འཐུན་པར་ཁོང་དུ་ཆུད་པར་བྱེད་ན། དགའ་བོ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེས་བདག་ལ་ནི་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་མངོན་དུ་གྱུར་ཏོ་ཞེས་བྱ་བར་རྟོགས་པར་རིག་པར་བྱའོ། །དགའ་བོ་རིགས་ཀྱི་བུ་འམ།
en: Ānanda, if any noble sons or noble daughters take up, uphold, recite, and master this profound perfection of wisdom, comprehending it according to its meaning, attributes, and letters, then, Ānanda, those noble sons or noble daughters should know that they will have been face-to-face with the tathāgatas, arhats, completely awakened buddhas. “

source: རིགས་ཀྱི་བུ་མོ་གང་ལ་ལ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ཟབ་མོ་འདི་བསྟན་པ་ཐོས་ན་ཕྱིར་མི་ཟློག་ཅིང་ངན་དུ་མི་བརྗོད་ལ་ཐོས་ནས་ཀྱང་མོས་པ་ཐོབ་པར་འགྱུར་ན། དགའ་བོ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་དེ་ནི་སྔོན་གྱི་རྒྱལ་བ་ལ་བྱ་བ་བྱས་པ། དགེ་བའི་རྩ་བ་བསྐྱེད་པ། དགེ་བའི་གཤེས་གཉེན་གྱིས་ཡོངས་སུ་བཟུང་བར་རིག་པར་བྱའོ།
en: Ānanda, if any noble sons or noble daughters, on hearing this profound perfection of wisdom being taught, do not turn away from it or speak ill of it, but if after hearing it they acquire firm belief, then, Ānanda, those noble sons or noble daughters should know that they have acted in the service of the conquerors of the past, cultivated the roots of virtuous action, and been accepted by a spiritual mentor. “

source: །དགའ་བོ་རིགས་ཀྱི་བུ་འམ། རིགས་ཀྱི་བུ་མོ་གང་ལ་ལས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ལྟ་ཡང་མི་སླུ་སྟེ། ཉན་ཐོས་སམ། རང་སངས་རྒྱས་སམ། སངས་རྒྱས་སུ་འགྱུར་མོད་ཀྱི། འོན་ཀྱང་དགའ་བོ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པ་དང་།
en: Ānanda, that they have cultivated the roots of virtuous action in the presence of tathāgatas, arhats, completely awakened buddhas is unfailing, and they will indeed become śrāvakas, pratyekabuddhas, or buddhas.
